app/controllers/admin/ajax_coctailes_controller.rb

SELECT "coctailes".* FROM "coctailes"
---
  def index
    @coctailes = Coctaile.all

UPDATE "coctailes" SET "name" = ?, "updated_at" = ? WHERE "coctailes"."id" = ?  [["name", "Absent & Juce (Pinapple)1"], ["updated_at", "2016-05-26 16:16:31.287550"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @coctaile.update_attributes(item_params)

DELETE FROM "coctailes" WHERE "coctailes"."id" = ?  [["id", 4]]
---
  def destroy
    @coctaile.destroy

SELECT  "coctailes".* FROM "coctailes" WHERE "coctailes"."id" = ?  ORDER BY "coctailes"."id" ASC LIMIT 1  [["id", 4]]
---
  def find_item
    @coctaile = Coctaile.where(id: params[:id]).first