app/controllers/admin/ingredients_controller.rb

SELECT  "coctailes".* FROM "coctailes" WHERE "coctailes"."id" = ? LIMIT 1  [["id", 3]]
---
  def new
    @ingredient = Ingredient.new
    coctaile = Coctaile.find_by(id: params[:coctaile_id])

INSERT INTO "ingredients" ("value", "coctaile_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["value", 30.0], ["coctaile_id", 3], ["product_id", 1], ["created_at", "2016-05-27 16:26:50.052092"], ["updated_at", "2016-05-27 16:26:50.052092"]]
---
  def create
    @ingredient = Ingredient.create item_params

SELECT  "coctailes".* FROM "coctailes" WHERE "coctailes"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    coctaile = Coctaile.find_by(id: params[:coctaile_id])

UPDATE "ingredients" SET "coctaile_id" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["coctaile_id", 3], ["updated_at", "2016-05-27 16:48:25.460890"], ["id", 3]]
---
  def update

    @ingredient.update_attributes item_params

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ?  ORDER BY "ingredients"."id" ASC LIMIT 1  [["id", 3]]
---
  def find_item
    @ingredient = Ingredient.where(id: params[:id]).first