app/views/admin/ingredients/_form.html.erb

      <div class="col-sm-10">
        <%= f.collection_select :product_id, Product.all, :id, :name, class: "form-control" %>
---
SELECT "products".* FROM "products"