app/controllers/welcome_controller.rb

SELECT "coctailes".* FROM "coctailes"
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."coctaile_id" IN (1, 2, 3, 4)
SELECT "products".* FROM "products" WHERE "products"."id" IN (1, 2, 3, 4, 5)
---
  def index
    @coctailes = Coctaile.includes(:ingredients, :products)

SELECT "products".* FROM "products" INNER JOIN "ingredients" ON "products"."id" = "ingredients"."product_id" WHERE "ingredients"."coctaile_id" = ?  [["coctaile_id", 4]]
SELECT DISTINCT COUNT(DISTINCT "coctailes"."id") FROM "coctailes" INNER JOIN "ingredients" ON "ingredients"."coctaile_id" = "coctailes"."id" INNER JOIN "products" ON "products"."id" = "ingredients"."product_id" WHERE "ingredients"."product_id" = ?  [["product_id", 4]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 4]]
---
  def show
    @coctailes = Coctaile.joins(:products).where(ingredients: {product_id: params[:id]}).distinct
    @product = Product.find_by id: params[:id]

SELECT  "coctailes".* FROM "coctailes" WHERE "coctailes"."id" IS NULL  ORDER BY "coctailes"."id" ASC LIMIT 1
---
  def find_item
	@coctaile = Coctaile.find_by id: params[:id]