app/views/admin/coctailes/show.html.erb

        <ul>
          <% @coctaile.ingredients.each do |ingredient| %>
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."coctaile_id" = ?  [["coctaile_id", 1]]

              <%= image_tag(ingredient.product.image_url, size: '50', class: "col-sm-3") if ingredient.product.image? %>
              <p class="col-sm-5"><%= "#{ingredient.product.name} #{ingredient.value}" %></p>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]